_posts/technology/2023-03-27-cppcoreguidelines-es20.html
---
layout: post
title: CppCoreGuidelines ES.20 确保对象总是被初始化
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Always initialize an object&rdquo;
</p>

<p>
理由
</p>

<p>
避免设置前使用的错误。以及可能产生的未定义行为。避免难理解的复杂的初始化。使重构变得简单。
</p>

<p>
例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">arg</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad: uninitialized variable</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
    i = 7;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">initialize i</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
<code>i = 7</code> 并不是初始化 <code>i</code> ，而是赋值给 <code>i</code> 。在省略号部分，可能就会读取 <code>i</code> 的未初始化的值。
</p>

<p>
更好的代码:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">arg</span><span style="color: #707183;">)</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">OK</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span> = 7;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">OK: initialized</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>;    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">OK: default initialized</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
注意
</p>

<p>
“总是要初始化”的规则比“对象必须设值”的规则更强。后者相对宽松，但是会导致：
</p>

<ul class="org-ul">
<li>难以阅读的代码</li>
<li>让人们在过大的范围声明变量</li>
<li>鼓励复杂的代码，导致逻辑bug</li>
<li>妨碍重构</li>
</ul>

<p>
总是要初始化规则是一个代码风格规则，可提升可维护性。
</p>


<p>
例子
</p>

<p>
这个例子经常用于演示对稍微宽松一些的初始化规则的需求：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">i</span>;    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">"widget" a type that's expensive to initialize,</span>
             <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">possibly a large POD</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">j</span>;

<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span>cond<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad: i and j are initialized "late"</span>
    i = f1<span style="color: #7388d6;">()</span>;
    j = f2<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
<span style="color: #7F0055; font-weight: bold;">else</span> <span style="color: #707183;">{</span>
    i = f3<span style="color: #7388d6;">()</span>;
    j = f4<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
以上代码不能很轻松地就重构，从而可以通过初始化操作来初始化 <code>i</code> 和 <code>j</code> 。注意，如果一个类型有默认构造函数，那么，你尝试推出初始化，只会简单的导致先进行默认初始化，再进行一次赋值操作。以上这种写法的主流原因是“效率”。但是编译器其实能够检测到我们是否犯了“设置前使用”错误，也能避免多余的重复初始化。
</p>


<p>
假设 <code>i</code> 与 <code>j</code> 之间有一些逻辑关联，那么这种关联可以通过代码表示：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">pair</span><span style="color: #707183;">&lt;</span>widget, widget<span style="color: #707183;">&gt;</span> <span style="color: #0000ff; font-weight: bold;">make_related_widgets</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">bool</span> <span style="color: #000000;">x</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span> ? <span style="color: #7388d6;">{</span>f1<span style="color: #909183;">()</span>, f2<span style="color: #909183;">()</span><span style="color: #7388d6;">}</span> : <span style="color: #7388d6;">{</span>f3<span style="color: #909183;">()</span>, f4<span style="color: #909183;">()</span><span style="color: #7388d6;">}</span>;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #707183;">[</span>i, j<span style="color: #707183;">]</span> = make_related_widgets<span style="color: #707183;">(</span>cond<span style="color: #707183;">)</span>;    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">C++17</span>
</pre>
</div>

<p>
如果说，你觉得 <code>make_related_widgets</code> 函数有些重复多余，我们也可以通过
<code>lambda</code> 省略之。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #707183;">[</span>i, j<span style="color: #707183;">]</span> = <span style="color: #707183;">[</span><span style="color: #110099;">x</span><span style="color: #707183;">]</span> <span style="color: #707183;">{</span> <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span> ? pair<span style="color: #7388d6;">{</span>f1<span style="color: #909183;">()</span>, f2<span style="color: #909183;">()</span><span style="color: #7388d6;">}</span> : pair<span style="color: #7388d6;">{</span>f3<span style="color: #909183;">()</span>, f4<span style="color: #909183;">()</span><span style="color: #7388d6;">}</span> <span style="color: #707183;">}()</span>;
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">C++17</span>
</pre>
</div>

<p>
利用某个特殊的值表示“未初始化”通常是一种问题的症状，而非解决方法：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">i</span> = uninit;  <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">widget</span> <span style="color: #000000;">j</span> = uninit;

<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
use<span style="color: #707183;">(</span>i<span style="color: #707183;">)</span>;         <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">possibly used before set</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>

<span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #707183;">(</span>cond<span style="color: #707183;">)</span> <span style="color: #707183;">{</span>     <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad: i and j are initialized "late"</span>
    i = f1<span style="color: #7388d6;">()</span>;
    j = f2<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
<span style="color: #7F0055; font-weight: bold;">else</span> <span style="color: #707183;">{</span>
    i = f3<span style="color: #7388d6;">()</span>;
    j = f4<span style="color: #7388d6;">()</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
这样写之后，编译器都无法简单的检测到“设置之前使用”这类错误。进一步来说，我们还在 <code>widget</code> 的状态空间引入了新的复杂性：哪些操作对未初始化的
<code>widget</code> 是合法的，哪些是不合法的？
</p>

<p>
多年以来，聪明的程序员流行使用复杂的初始化方法。然而，这往往是大部分代码错误和复杂的来源。很多这类错误会在代码实现之后若干年的维护过程中引入。
</p>

<p>
例如：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">ci</span><span style="color: #7388d6;">)</span> : m2<span style="color: #7388d6;">{</span>i<span style="color: #7388d6;">}</span>, cm2<span style="color: #7388d6;">{</span>ci<span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{}</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>

<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">m1</span> = 7;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">m2</span>;
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">m3</span>;

    <span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">cm1</span> = 7;
    <span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">cm2</span>;
    <span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">cm3</span>;
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
编译器会标记出未初始化的 <code>cm3</code> ，因为这是个 <code>const</code> 成员变量。但是编译器不会发现 <code>m3</code> 缺少初始化。通常，偶尔的伪造的成员变量初始化是值得的。因为它可以避免缺少初始化而引起的错误。而且，编译器经常能够优化掉多余的初始化（比如，赋值操作前的一次初始化）。
</p>


<p>
例外
</p>

<p>
如果你声明一个以输入数据进行初始化的对象，那么在此之前进行初始化，会导致重复初始化。然而，必须注意，不要在输入数据之后，还存在未初始化的对象。那样会导致错误，以及安全性问题。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">constexpr</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">max</span> = 8 * 1024;
<span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">buf</span><span style="color: #707183;">[</span>max<span style="color: #707183;">]</span>;         <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">OK, but suspicious: uninitialized</span>
f.read<span style="color: #707183;">(</span>buf, max<span style="color: #707183;">)</span>;
</pre>
</div>

<p>
初始化这个大数组可能在某些情况下比较消耗计算资源。但是，这个例子中，未初始化的变量可能被访问。所以千万要小心处理。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">constexpr</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">max</span> = 8 * 1024;
<span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">buf</span><span style="color: #707183;">[</span>max<span style="color: #707183;">]</span> = <span style="color: #707183;">{}</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">zero all elements; better in some situations</span>
f.read<span style="color: #707183;">(</span>buf, max<span style="color: #707183;">)</span>;
</pre>
</div>

<p>
因为对于数组和 <code>std::array</code> 的约束性初始化规则，所以有很多针对这类数据的例外情况。
</p>

<p>
但是，如果可以，尽量使用不会溢出的库函数。比如：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">s is default initialized to ""</span>
cin &gt;&gt; s;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">s expands to hold the string</span>
</pre>
</div>

<p>
对于简单的变量，不要考虑套用这里提到的例外情况（通过输入数据初始化）。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">bad</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
cin &gt;&gt; i;
</pre>
</div>

<p>
通常，输入操作和对象的操作可能会分开，就可能会出现“设置前使用”的情况。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">int</span> <span style="color: #000000;">i2</span> = 0;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">better, assuming that zero is an acceptable value for i2</span>
<span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
cin &gt;&gt; i2;
</pre>
</div>

<p>
一个好的编译优化器应该能识别输入操作，避免多余的初始化操作。
</p>


<p>
注意
</p>

<p>
有时候，我们可以用 <code>lambda</code> 作为初始化工具，从而避免未初始化的变量：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">error_code</span> <span style="color: #000000;">ec</span>;
<span style="color: #000000; font-style: italic; text-decoration: underline;">Value</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">[</span>&amp;<span style="color: #707183;">]</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">p</span> = get_value<span style="color: #7388d6;">()</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">get_value() returns a pair&lt;error_code, Value&gt;</span>
    ec = p.first;
    <span style="color: #7F0055; font-weight: bold;">return</span> p.second;
<span style="color: #707183;">}()</span>;
</pre>
</div>

<p>
或者，可能这样：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #000000; font-style: italic; text-decoration: underline;">Value</span> <span style="color: #000000;">v</span> = <span style="color: #707183;">[]</span> <span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">auto</span> <span style="color: #000000;">p</span> = get_value<span style="color: #7388d6;">()</span>;   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">get_value() returns a pair&lt;error_code, Value&gt;</span>
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>p.first<span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">throw</span> Bad_value<span style="color: #7388d6;">{</span>p.first<span style="color: #7388d6;">}</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> p.second;
<span style="color: #707183;">}()</span>;
</pre>
</div>

<p>
强化
</p>

<p>
标记每一个未初始化的变量。不要标记有默认构造函数的用户类型。
</p>

<p>
确保未初始化的缓冲区在声明之后马上写入数据。以非 const 参数类型传递未初始化的变量，可以认为是对变量的一次写入操作。
</p>
